#+title: Introdução à Linguagem R - Instalação
#+subtitle: Para instalação, siga o vídeo: https://www.youtube.com/watch?v=nlkjH1J3oP0
#+AUTHOR: Pedro G. Branquinho, Black Scorpion Software

*** Exemplo 1 - Imperativa
Rotinas Imperativas

#+begin_src R :session :results output
weight <- 85
size <- 1.84
(BMI <- weight/size^2)
#+end_src

#+RESULTS:
: [1] 25.10633

*** Exemplo 2 - Orientação a Objeto

#+begin_src R :session
### Definition of an object BMI
setClass("BMI", representation(weight="numeric", size="numeric"))
#+end_src

#+begin_src R :session

setMethod("show", "BMI",
 function(object){cat("BMI =",object@weight/(object@size^2)," \n ")}
 )
#+end_src

#+RESULTS:
: show

#+begin_src R :session :results output
### Creation of an object for me, and posting of my BMI
(myBMI <- new("BMI",weight=85,size=1.84))

### Creation of an object for her, and posting of her BMI
(herBMI <- new("BMI",weight=62,size=1.60))
#+end_src

#+RESULTS:
: BMI = 25.10633
: BMI = 24.21875

*** Exemplo 2 - OOP and Typechecking
#+begin_src R :session :results output
### Traditional programming, no type
(weight <- "Hello")

## Using classes
 new("BMI",weight="Hello",size=1.84)
#+end_src

#+RESULTS:
: [1] "Hello"
: Error in validObject(.Object) :
:   invalid class “BMI” object: invalid object for slot "weight" in class "BMI": got class "character", should be or extend class "numeric"
*** Exemplo 3 - OOP and Inspection/Reflexion
#+begin_src R :session :results output
herBMI.show()
## Error in herBMI.show() : could not find function "herBMI.show"

herBMI.show
## Error: object 'herBMI.show' not found

herBMI
## BMI= 24.21875

is.object(herBMI)
## [1] TRUE
#+end_src

#+RESULTS:
: Error in herBMI.show() : could not find function "herBMI.show"
: Error: object 'herBMI.show' not found
: BMI= 24.21875
: [1] TRUE

*** Exemplo 6 - Semelhanças com outras linguagens

#+begin_src go
package main

import (
	"fmt"
	"strconv"
)

type Person struct {
	name string
	age  int
}

func (p Person) show() string {
	return p.name + " " + strconv.Itoa(p.age)
}

func main() {

	//creating struct specifying field names
	p1 := Person{
		name: "Fulano",
		age: 20,
	}

	//creating struct without specifying field names
	p2 := Person{"Ciclano", 37}

    // "show" method
	fmt.Println(p1.show())
	fmt.Println(p2.show())
}
#+end_src

#+RESULTS:
: Fulano 20
: Ciclano 37

*** Exemplo 1
- Local Escoping
#+begin_src lisp :results export
(let ((a 1)
      (b 2))
    (+ a b))
#+end_src

#+RESULTS:
: 3

- Implicit Local Escoping
#+begin_src lisp :results export
(defun f (a b)
  (+ a b))

(f 1 2)
#+end_src

#+RESULTS:
: 3

*** Exemplo 2
#+begin_src lisp
(defclass book ()
  ((title :reader title
          :initarg :title)
   (author :reader author
           :initarg :author))
  (:documentation "Describes a book."))

(defmethod show ((b1 book))
  (let ((titulo (title b1))
        (autor (author b1)))
   (print (format T "~S, ~S" titulo autor))))

(defparameter b1 (make-instance 'book
                        :title "ANSI Common Lisp"
                        :author "Paul Graham"))
#+end_src

#+RESULTS:
: B1

#+begin_src lisp :results output
(show b1)
#+end_src

#+RESULTS:
: "ANSI Common Lisp", "Paul Graham"
: NIL
